console.log('1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).');

let res = '';
let iterator = 20;
let max = 30;
while (iterator <= max) {
    iterator += 0.5;
    res += iterator + ' ';
}
console.log(res);
console.log(` `);
// --------------------------

console.log('2. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.');

let it = 10;
const max2 = 100;
const S = 27;
do {
    console.log(`${it} доларів коштує ${it * S}`);
    it += 10;
} while (it <= max2);
console.log(` `);
// --------------------------

console.log('3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N');

const n = +prompt('Введіть число:');
if (n > 0) {
    for (let i = 1; i <= 100; i++) {
        if (i ** 2 <= n) {
            console.log(`${i} в квадраті ${i ** 2}`);
        }
    }
} else {
    console.log('Oops...');
}
console.log(` `);
// --------------------------

console.log('4. Дане ціле число. З\'ясувати, чи є воно простим ' +
    '(простим називається число, більше 1, які не мають інших дільників крім 1 і себе).');

const c = +prompt('Введіть ціле число:');
let ind = 0;
if (c > 0) {
    for (let i = 2; i < c; i++) {
        if (c % i === 0) {
            ind += 1;
        }
    }
    if (ind !== 0) {
        console.log('число не просте');
    } else {
        console.log('число просте');
    }
} else {
    console.log('Oops...');
}
console.log(` `);
// --------------------------

console.log('5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. ' +
    '(Наприклад, числа 9, 81 можна отримати, а 13 - не можна).');

const w = +prompt('Введіть число:');
let q = 0;
if (w > 0) {
    for (let i = 1; i < w; i++) {
        if (3 ** i === w) {
            q += 1;
        }
    }
    if (q !== 0) {
        console.log('можливо');
    } else {
        console.log('не можливо');
    }
} else {
    console.log('Oops...');
}







